---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions
source: html/1d4d6dcc-691a-e59c-829d-7073fc256c6b.htm
---
# BuildingEnvelopeAnalyzerOptions Members

Constructs a new instance of BuildingEnvelopeAnalyzerOptions, using default values.